package day15_collection_set;

public class Day_15_Note {
/*
 * 一、集合 (Collection)
 * 	1.集合架構其實就是種動態陣列，動態陣列(dynamic array)與靜態陣列(static array)的特色如下：
 * 		----------------------------------------
 * 				執行速度	維護		使用時機
 * 		----------------------------------------
 * 		靜態陣列	較快		較難		程式性質: 分析 > 維護
 * 		----------------------------------------
 * 		動態陣列	較慢		較簡單	程式性質: 維護 > 分析
 * 		----------------------------------------
 * 
 * 	2.集合可以分為三大類:
 * 		--------------------------------------------------
 * 				元素可重複？	範例
 * 		--------------------------------------------------
 * 		Set			X		["國文","英文","數學","化學"]
 * 		--------------------------------------------------
 * 		List		O		[100, 90, 90, 80]
 * 		--------------------------------------------------
 * 		Map			X		[國文=100, 英文=90, 數學=90, 化學=80]
 * 		--------------------------------------------------
 * 		※ Map是由 Key(國文)+ Value(100分)組成，Key值不可重複，Value可重複。
 * 			Key + Value = Entry。 由於每個Entry不重複，因此 Map 又可以稱為 Entry Set
 * 
 * 	3.每個集合都是一種容器，而規定這些容器可以裝什麼的東西就是 <泛型>
 * 	4.執行續安全不足時，代表該程式執行上存在許多不確定性，致使程式不穩定，因此只適合單工
 * 	5.Set家族最常使用的幾種類型：HashSet、LinkedHashSet、TreeSet，其中
 * 		-----------------------------------------------------------------------------
 * 						記憶體中資料			資料輸出順序			優點			缺點
 * 						擺放方法				
 * 		-----------------------------------------------------------------------------
 * 		LinkedHashSet	按照資料加入順序			按照資料加入順序輸出		增、刪、修		查詢資料慢
 * 						用一維線性方式擺放							速度快
 * 		-----------------------------------------------------------------------------
 * 		TreeSet			二維樹狀結構配置			資料按照ASCII code		查詢資料快		增、刪、修
 * 											順序輸出							速度慢
 * 		-----------------------------------------------------------------------------
 * 
 * */
}
